In [19]:
import numpy as np
import pandas as pd

# Uvoz in priprava podatkov

## PRIMER 1

### 1. Read csv file into a pandas dataframe

In [20]:
rdd = pd.read_csv('data/DATA_DN_property data.csv')
print (rdd)
rdd.head(20)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       2.0   950
7  100008000.0   213.0     TREMONT            Y           --       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       2.0   950
7  100008000.0   213.0     TREMONT            Y           --       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

### 2. Take a look at the first 5 rows

In [21]:
rdd = pd.read_csv('data/DATA_DN_property data.csv')
rdd.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0   BERKELEY           12            1       NaN   700
4          NaN   203.0   BERKELEY            Y            3       2.0  1600

### 3. Select and print the ST_NUM column

In [4]:
stcolumn = rdd.iloc[:,1]
print (stcolumn)

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

### 4. Standard Missing Values: Check the misssing values in ST_NUM column with isnull() method

In [22]:
stcolumn.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool


### 5. Non-Standard Missing Values: Pandas didn't recognized the "--" and "na" as a missing value. in the NUM_BEDROOMS column. Try to detect these various missing values with the na_values parameter when importing the data with read_csv.

In [23]:
nsmv = ["n/a", "na", "--"]
rdd = pd.read_csv('data/DATA_DN_property data.csv', na_values= nsmv)
rdd.head(20)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

### 6. Unexpected Missing Values

For example, if our feature is expected to be a string, but there’s a numeric type, then technically this is also a missing value.

#### Display the OWN_OCCUPIED column and it's missing values with isnull()

In [24]:
print (rdd['OWN_OCCUPIED'].isnull())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.

#### Write a loop to detect int values in the OWN_OCCUPIED column and count them

In [11]:
nsmv = ["n/a", "na", "--"]
rdd = pd.read_csv('data/DATA_DN_property data.csv', na_values= nsmv)


count=0
for row in rdd['OWN_OCCUPIED']:
    try:
        int(row)
        rdd.loc[count, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    count+=1 
rdd.head(20)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

### 7. Print the total number of missing values for each column.

In [12]:
print (rdd.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        1
SQ_FT           2
dtype: int64

### 8. Check to see if we have any missing values in the df at all in one line.

Hint: `.any()` method

In [13]:
print (rdd.isnull().values.any())

True

### 9. Total count of missing values.

In [25]:
print (rdd.isnull().sum().sum())

11

### 10. Replace missing values with a number 125 in the ST_NUM column

In [15]:
rdd ['ST_NUM'].fillna(125, inplace=True)
rdd.head(20)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,125.0,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,125.0,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

###  11. Replace missing values with a median value in the NUM_BEDROOMS column

In [27]:
median = rdd['NUM_BEDROOMS'].median()
rdd['NUM_BEDROOMS'].fillna(median, inplace=True)
rdd.head(20)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,3.0,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,3.0,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,3.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,3.0,2.0,1800.0